# Filtros, Selects e Slices

##

In [2]:
# Dados de Exemplo
import pandas as pd
dados = pd.read_csv('Datasets/aluguel.csv', sep = ';')
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
6,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
7,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,NaN,NaN
8,Casa de Condomínio,Ramos,2,2,0,65,1000.0,NaN,NaN
9,Conjunto Comercial/Sala,Centro,0,3,0,695,35000.0,19193.0,3030.0

## Filtro com Serie Booleana

   __Podemos Filtra um Data Frame por uma lista/série Boleana, utilizando a notação `DF[bool_list]` tendo como resultado as linhas de index `True`__

Podemos utilizar o método `df['colona].isin(list)` para vericar se os elementos da list percetem a coluna do df, `retornando um vetor boleano`

In [3]:
# Criando uma lista de boleanos para filtrar os tipos residenciais do Df acima

residencial = ['Quitinete',
 'Casa',
 'Apartamento',
 'Casa de Condomínio',
 'Casa de Vila']

selecao = dados['Tipo'].isin(residencial)
selecao.head()

0     True
1     True
2    False
3     True
4     True
Name: Tipo, dtype: bool

In [12]:
# Aplicando o Filtro nas linhas do DF
dados_residencial = dados[selecao]
dados_residencial.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN

In [18]:
dados_residencial.to_csv('Datasets/aluguel_residencial.csv', sep = ';', index = False)

## Filtro com Método DF.query("query")

In [17]:
df2  = dados.query('Tipo  == "Casa de Condomínio" or Tipo ==  "Casa de Vila"')
df2.tail()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
32869,Casa de Condomínio,Barra da Tijuca,4,3,4,460,12000.0,1000.0,1200.0
32898,Casa de Condomínio,Barra da Tijuca,5,2,5,554,20000.0,1892.0,1743.0
32908,Casa de Condomínio,Freguesia (Jacarepaguá),3,3,1,155,2000.0,530.0,1250.0
32924,Casa de Condomínio,Barra da Tijuca,3,5,3,1000,20000.0,3000.0,NaN
32952,Casa de Condomínio,Barra da Tijuca,5,3,4,450,15000.0,1711.0,2332.0

In [16]:
df2.Tipo.unique()

array(['Casa de Condomínio', 'Casa de Vila'], dtype=object)

## Filtros e Selects por Slice

In [21]:
# Criando o DF de Exemplo
data = [(1, 2, 3, 4), 
        (5, 6, 7, 8), 
        (8, 10, 11, 12), 
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

__O método de Slices de linhas e colunas pode ser posicional ou por indice nomeado: `Df[n:m][lista de colunas]` onde `n:m` é o range de posição das linhas__

### Select

In [22]:
# Retornando primeira coluna c1 e todas as linhas
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [23]:
# Retornado 2 ou mais colunas e todas as linhas
df[['c1','c3']]

    c1  c3
l1   1   3
l2   5   7
l3   8  11
l4  13  15

### Filtro de Linhas

In [24]:
# Linhas 2 e 3 e todas as Colunas
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [25]:
# Filtrando linhas e Colunas
## Utilizamos a Notação Completa Df[n:m][lista de colunas]
### linhas 2 e 3  + colunas c2 e c3

df[1:3][['c2','c3']]

    c2  c3
l2   6   7
l3  10  11

## Filtros e Select com df.loc e df.iloc()

__O Método loc permite filtrar linhas e colunas pelo `nome dos index`, utilizando a notação `df.loc[['ln', 'lm'], ['cn', 'cm']]`__

__Já o Método iloc permite filtrar linhas e colunas pelo `Número dos index`, utilizando a notação `df.iloc[[n, m], [n, m]]`__

In [26]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [28]:
df.iloc[0, 1]

2

In [27]:
df.iloc[[2, 0], [3, 0]]

    c4  c1
l3  12   8
l1   4   1

# Fim